#
# synthesize prol16
#

# some variables
set design cpu
set sources {prol16_pack alu reg_file datapath control sync_reset cpu}

# analyze
echo "Analyzing..."
foreach s $sources {
    analyze -format vhdl ../src/${s}.vhd
}

# elaborate
echo "Elaborate..."
elaborate $design

# set environment and constraints
set_operating_conditions WORST
create_clock [get_ports clk_i] -period 200
set_ideal_network [get_ports res_i]
set_ideal_network [get_ports sync_reset_inst/res_sync_o]
set_max_area 0

# compile
echo "Compile..."
compile

# write results

# changing names is required for legal identifiers
echo "Changing names..."
change_names -rules verilog -hierarchy

echo "Writing netlist and SDF..."
write -hierarchy -format verilog -output netlist/${design}.v
write_sdf -context verilog -version 2.1 netlist/${design}.snps.sdf
# use INWAY sdf patchers to fix snps' stuff
exec /usr/bin/env IFXPERL=/opt/perl_5.8.7/bin/perl /opt/inway_5.2.1/bin/sdf_patch \
    -step synthesis -list_ntc_cells ntc.lst netlist/$design.snps.sdf netlist/$design.sdf

echo "Writing reports..."
report_area > ../doc/${design}_area.rep
report_timing > ../doc/${design}_timing.rep
